[
  {
    "id": 1,
    "title": "Coinnect Four",
    "coverTitle": "Coinnect Four: Multiplayer Game",
    "subtitle": "Coin-Themed Mobile App for Android",
    "description": "A multiplayer Connect Four game with a unique coin theme, developed for my Android course final project.",
    "descriptionLong": "My friend and I developed Coinnect Four, a unique coin-themed version of Connect Four for Android. We designed an intuitive UI with Figma and built the game using Kotlin and Jetpack Compose for smooth, responsive gameplay. This project strengthened our app development skills and teamwork.",
    "imageFileName": "coinnect.png",
    "labels": ["Android", "Kotlin", "Jetpack Compose", "Game", "Multiplayer"],
    "type": "app"
  },
  {
    "id": 2,
    "title": "Morgon & afton",
    "coverTitle": "Morning and Evening Adhkar App",
    "subtitle": "Morning and Evening Adhkar with Swedish Translation",
    "description": "A morning and evening adhkar app with Swedish translation and Arabic transliteration.",
    "descriptionLong": "This app is designed to help Muslims recite morning and evening adhkar with ease. It includes Arabic text, Swedish translation, and Arabic transliteration to assist in proper pronunciation.",
    "imageFileName": "morgon_afton.png",
    "labels": ["Android", "Kotlin", "Jetpack Compose"],
    "type": "app"
  },
  {
    "id": 3,
    "title": "Wise Words",
    "coverTitle": "Motivational Quotes App",
    "subtitle": "Motivational Quotes for iOS",
    "description": "Motivational quote app for saving and sharing favorites, developed for my iOS course final project.",
    "descriptionLong": "Wise Words allows users to discover, save, and share motivational quotes. Built using Swift and SwiftUI, it offers a clean and intuitive UI, making it easy to stay inspired throughout the day.",
    "imageFileName": "wise_words.png",
    "labels": ["iOS", "Swift", "SwiftUI", "SwiftData"],
    "type": "app"
  },
  {
    "id": 4,
    "title": "Lite Weather",
    "coverTitle": "Simple Weather App",
    "subtitle": "Minimalist Weather Forecast for iOS",
    "description": "A simple weather app that displays the current weather and forecast for the next 5 days.",
    "descriptionLong": "Lite Weather provides accurate weather forecasts for up to five days. Developed with SwiftUI, it presents the forecast in a minimal and user-friendly layout for quick weather updates.",
    "imageFileName": "lite_weather.png",
    "labels": ["iOS", "Swift", "SwiftUI"],
    "type": "app"
  },
  {
    "id": 5,
    "title": "Jkpg City Rebrand",
    "coverTitle": "User-Focused Website Rebranding",
    "subtitle": "Interactive Website Rebranding for Jkpg City",
    "description": "A rebranding project for Jkpg city, focusing on enhancing the user interactivity.",
    "descriptionLong": "This project involved rebranding the Jkpg city website to improve user interaction and accessibility. Using modern web technologies such as ReactJS and Docker, we transformed the website into a more interactive and dynamic experience.",
    "imageFileName": "jkpg_city_rebrand.png",
    "labels": ["Website", "Javascript", "ReactJS", "NodeJS", "Docker"],
    "type": "web"
  },
  {
    "id": 6,
    "title": "Portfolio v1",
    "coverTitle": "First Personal Portfolio",
    "subtitle": "Initial Version of My Personal Portfolio",
    "description": "My first Personal portfolio website, made with basic HTML, CSS and Javascript.",
    "descriptionLong": "This was the initial version of my personal portfolio, where I showcased my skills and projects. It was a simple static website, built using fundamental web technologies such as HTML, CSS, and Javascript.",
    "imageFileName": "portfolio_v1.png",
    "labels": ["Website", "Javascript", "HTML", "CSS"],
    "type": "web"
  },
  {
    "id": 7,
    "title": "Portfolio v2",
    "coverTitle": "Updated Personal Portfolio",
    "subtitle": "Modern Personal Portfolio with React and NextJS",
    "description": "My new Personal portfolio website, made with React and NextJS.",
    "descriptionLong": "This is the second version of my portfolio, utilizing modern web technologies like ReactJS and Next.js. The site showcases my latest projects and skills in a more dynamic and interactive manner.",
    "imageFileName": "portfolio_v2.png",
    "labels": ["Website", "React", "NextJS", "Javascript", "HTML", "CSS"],
    "type": "web"
  },
  {
    "id": 8,
    "title": "Resume",
    "coverTitle": "Personal Resume Website",
    "subtitle": "Interactive Resume Website",
    "description": "A simple website for displaying my resume, made with basic HTML, CSS and Javascript.",
    "descriptionLong": "This website was created to showcase my resume in an accessible and interactive way. The design is minimal yet functional, with all the essential information presented cleanly.",
    "imageFileName": "resume.png",
    "labels": ["Website", "Javascript", "HTML", "CSS"],
    "type": "web"
  }
]
